{
    "roleScopeTagIds":  [
                            "0"
                        ],
    "periodOfflineBeforeAccessCheck":  "PT12H",
    "allowedDataIngestionLocations":  [
                                          "oneDriveForBusiness",
                                          "sharePoint",
                                          "camera"
                                      ],
    "wipeAfterCompanyPortalUpdateDeferralInDays":  0,
    "version":  "\"f0006704-0000-0300-0000-68bf44fc0000\"",
    "displayName":  "Unmanaged Android App Protection",
    "maximumPinRetries":  5,
    "deviceLockRequired":  false,
    "maximumAllowedDeviceThreatLevel":  "notConfigured",
    "minimumWarningAppVersion":  null,
    "requirePinAfterBiometricChange":  false,
    "customDialerAppDisplayName":  "",
    "customBrowserDisplayName":  "",
    "appActionIfAndroidSafetyNetAppsVerificationFailed":  "block",
    "managedBrowser":  "notConfigured",
    "description":  "",
    "screenCaptureBlocked":  true,
    "protectedMessagingRedirectAppType":  "anyApp",
    "connectToVpnOnLaunch":  false,
    "allowedAndroidDeviceManufacturers":  null,
    "appActionIfSamsungKnoxAttestationRequired":  null,
    "pinCharacterSet":  "numeric",
    "maximumWipeOsVersion":  null,
    "contactSyncBlocked":  true,
    "simplePinBlocked":  true,
    "customDialerAppPackageId":  "",
    "appActionIfDeviceLockNotSet":  "block",
    "minimumRequiredAppVersion":  null,
    "minimumWipeAppVersion":  null,
    "requireClass3Biometrics":  false,
    "appActionIfAndroidDeviceModelNotAllowed":  "block",
    "minimumWarningPatchVersion":  "0000-00-00",
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
    "minimumRequiredOsVersion":  null,
    "organizationalCredentialsRequired":  false,
    "disableAppEncryptionIfDeviceEncryptionIsEnabled":  false,
    "fingerprintBlocked":  false,
    "minimumWipeCompanyPortalVersion":  null,
    "appActionIfDevicePasscodeComplexityLessThanHigh":  null,
    "isAssigned":  false,
    "customBrowserPackageId":  "",
    "appActionIfDevicePasscodeComplexityLessThanMedium":  null,
    "appActionIfAccountIsClockedOut":  null,
    "allowedAndroidDeviceModels":  [

                                   ],
    "deviceComplianceRequired":  true,
    "minimumWarningOsVersion":  null,
    "minimumRequiredCompanyPortalVersion":  null,
    "@odata.type":  "#microsoft.graph.androidManagedAppProtection",
    "appActionIfMaximumPinRetriesExceeded":  "block",
    "dialerRestrictionLevel":  "allApps",
    "requiredAndroidSafetyNetDeviceAttestationType":  "none",
    "approvedKeyboards":  [

                          ],
    "minimumRequiredPatchVersion":  "0000-00-00",
    "messagingRedirectAppPackageId":  "",
    "maximumWarningOsVersion":  null,
    "disableAppPinIfDevicePinIsSet":  false,
    "targetedAppManagementLevels":  "unspecified",
    "pinRequired":  true,
    "minimumWipePatchVersion":  "0000-00-00",
    "printBlocked":  false,
    "pinRequiredInsteadOfBiometricTimeout":  null,
    "messagingRedirectAppDisplayName":  "",
    "minimumWipeOsVersion":  null,
    "warnAfterCompanyPortalUpdateDeferralInDays":  0,
    "appActionIfDeviceComplianceRequired":  "block",
    "allowedOutboundClipboardSharingLevel":  "managedAppsWithPasteIn",
    "id":  "T_8e3e2d60-54d9-4bcb-a6cb-fa601f4ace04",
    "mobileThreatDefenseRemediationAction":  "block",
    "periodBeforePinReset":  "PT0S",
    "requiredAndroidSafetyNetEvaluationType":  "basic",
    "allowedOutboundDataTransferDestinations":  "managedApps",
    "allowedInboundDataTransferSources":  "allApps",
    "encryptAppData":  true,
    "blockDataIngestionIntoOrganizationDocuments":  false,
    "previousPinBlockCount":  0,
    "appActionIfUnableToAuthenticateUser":  null,
    "saveAsBlocked":  true,
    "gracePeriodToBlockAppsDuringOffClockHours":  null,
    "blockAfterCompanyPortalUpdateDeferralInDays":  0,
    "notificationRestriction":  "allow",
    "periodOnlineBeforeAccessCheck":  "PT30M",
    "minimumPinLength":  6,
    "allowedOutboundClipboardSharingExceptionLength":  0,
    "deployedAppCount":  12,
    "appGroupType":  "allCoreMicrosoftApps",
    "exemptedAppPackages":  [

                            ],
    "keyboardsRestricted":  false,
    "requiredAndroidSafetyNetAppsVerificationType":  "none",
    "mobileThreatDefensePartnerPriority":  null,
    "managedBrowserToOpenLinksRequired":  false,
    "fingerprintAndBiometricEnabled":  null,
    "appActionIfDevicePasscodeComplexityLessThanLow":  null,
    "appActionIfAndroidDeviceManufacturerNotAllowed":  "block",
    "dataBackupBlocked":  true,
    "biometricAuthenticationBlocked":  false,
    "allowedDataStorageLocations":  [
                                        "oneDriveForBusiness",
                                        "sharePoint"
                                    ],
    "periodOfflineBeforeWipeIsEnforced":  "P90D",
    "minimumWarningCompanyPortalVersion":  null,
    "appActionIfAndroidSafetyNetDeviceAttestationFailed":  "block",
    "maximumRequiredOsVersion":  null
}
