{
    "allowedOutboundDataTransferDestinations":  "none",
    "displayName":  "Unmanaged Windows - Edge",
    "description":  "App Protection Policy for Unmanaged Windows devices",
    "allowedInboundDataTransferSources":  "none",
    "minimumWarningAppVersion":  null,
    "maximumWarningOsVersion":  null,
    "minimumRequiredSdkVersion":  null,
    "minimumWarningOsVersion":  null,
    "minimumWipeAppVersion":  null,
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "minimumWipeSdkVersion":  null,
    "mobileThreatDefenseRemediationAction":  "block",
    "@odata.type":  "#microsoft.graph.windowsManagedAppProtection",
    "minimumWipeOsVersion":  null,
    "printBlocked":  true,
    "deployedAppCount":  1,
    "id":  "I_1be2979b-5fc1-49ce-8f09-a7d2aff006f2",
    "periodOfflineBeforeWipeIsEnforced":  "P90D",
    "minimumRequiredAppVersion":  null,
    "maximumRequiredOsVersion":  null,
    "maximumAllowedDeviceThreatLevel":  "notConfigured",
    "version":  "\"b1010ac7-0000-0300-0000-658092580000\"",
    "allowedOutboundClipboardSharingLevel":  "none",
    "isAssigned":  false,
    "appActionIfUnableToAuthenticateUser":  null,
    "maximumWipeOsVersion":  null,
    "minimumRequiredOsVersion":  null,
    "periodOfflineBeforeAccessCheck":  "P7D"
}
