{
    "appActionIfUnableToAuthenticateUser":  null,
    "appActionIfAccountIsClockedOut":  null,
    "@odata.type":  "#microsoft.graph.iosManagedAppProtection",
    "customBrowserProtocol":  "",
    "deployedAppCount":  11,
    "deviceComplianceRequired":  true,
    "exemptedAppProtocols":  [
                                 {
                                     "name":  "Default",
                                     "value":  "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
                                 }
                             ],
    "minimumWipeAppVersion":  null,
    "allowedDataIngestionLocations":  [
                                          "oneDriveForBusiness",
                                          "sharePoint",
                                          "camera"
                                      ],
    "allowedInboundDataTransferSources":  "allApps",
    "managedBrowserToOpenLinksRequired":  false,
    "pinRequired":  true,
    "maximumWarningOsVersion":  null,
    "protectedMessagingRedirectAppType":  "anyApp",
    "minimumRequiredSdkVersion":  null,
    "exemptedUniversalLinks":  [
                                   "http://facetime.apple.com",
                                   "http://maps.apple.com",
                                   "https://facetime.apple.com",
                                   "https://maps.apple.com"
                               ],
    "simplePinBlocked":  true,
    "minimumPinLength":  6,
    "disableAppPinIfDevicePinIsSet":  false,
    "dialerRestrictionLevel":  "allApps",
    "appActionIfMaximumPinRetriesExceeded":  "block",
    "allowedOutboundClipboardSharingExceptionLength":  0,
    "notificationRestriction":  "allow",
    "periodOnlineBeforeAccessCheck":  "PT30M",
    "description":  "",
    "minimumRequiredAppVersion":  null,
    "allowWidgetContentSync":  true,
    "dataBackupBlocked":  true,
    "contactSyncBlocked":  true,
    "appActionIfIosDeviceModelNotAllowed":  "block",
    "managedUniversalLinks":  [
                                  "http://*.appsplatform.us/*",
                                  "http://*.onedrive.com/*",
                                  "http://*.powerapps.cn/*",
                                  "http://*.powerapps.com/*",
                                  "http://*.powerapps.us/*",
                                  "http://*.powerbi.com/*",
                                  "http://*.service-now.com/*",
                                  "http://*.sharepoint-df.com/*",
                                  "http://*.sharepoint.com/*",
                                  "http://*.yammer.com/*",
                                  "http://*.zoom.us/*",
                                  "http://*collab.apps.mil/l/*",
                                  "http://*devspaces.skype.com/l/*",
                                  "http://*teams-fl.microsoft.com/l/*",
                                  "http://*teams.live.com/l/*",
                                  "http://*teams.microsoft.com/l/*",
                                  "http://*teams.microsoft.us/l/*",
                                  "http://app.powerbi.cn/*",
                                  "http://app.powerbi.de/*",
                                  "http://app.powerbigov.us/*",
                                  "http://msit.microsoftstream.com/video/*",
                                  "http://tasks.office.com/*",
                                  "http://to-do.microsoft.com/sharing*",
                                  "http://web.microsoftstream.com/video/*",
                                  "http://zoom.us/*",
                                  "https://*.appsplatform.us/*",
                                  "https://*.onedrive.com/*",
                                  "https://*.powerapps.cn/*",
                                  "https://*.powerapps.com/*",
                                  "https://*.powerapps.us/*",
                                  "https://*.powerbi.com/*",
                                  "https://*.service-now.com/*",
                                  "https://*.sharepoint-df.com/*",
                                  "https://*.sharepoint.com/*",
                                  "https://*.yammer.com/*",
                                  "https://*.zoom.us/*",
                                  "https://*collab.apps.mil/l/*",
                                  "https://*devspaces.skype.com/l/*",
                                  "https://*teams-fl.microsoft.com/l/*",
                                  "https://*teams.live.com/l/*",
                                  "https://*teams.microsoft.com/l/*",
                                  "https://*teams.microsoft.us/l/*",
                                  "https://app.powerbi.cn/*",
                                  "https://app.powerbi.de/*",
                                  "https://app.powerbigov.us/*",
                                  "https://msit.microsoftstream.com/video/*",
                                  "https://tasks.office.com/*",
                                  "https://to-do.microsoft.com/sharing*",
                                  "https://web.microsoftstream.com/video/*",
                                  "https://zoom.us/*"
                              ],
    "pinCharacterSet":  "numeric",
    "genmojiConfigurationState":  "blocked",
    "minimumWipeSdkVersion":  null,
    "maximumPinRetries":  5,
    "disableProtectionOfManagedOutboundOpenInData":  false,
    "isAssigned":  false,
    "displayName":  "Unmanaged iOS App Protection",
    "id":  "T_741af367-8667-4e33-92f4-9953f0df23a4",
    "mobileThreatDefensePartnerPriority":  null,
    "blockDataIngestionIntoOrganizationDocuments":  false,
    "periodOfflineBeforeAccessCheck":  "P1D",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
    "periodBeforePinReset":  "PT0S",
    "allowedIosDeviceModels":  null,
    "allowedDataStorageLocations":  [
                                        "oneDriveForBusiness",
                                        "sharePoint"
                                    ],
    "mobileThreatDefenseRemediationAction":  "block",
    "appActionIfDeviceComplianceRequired":  "block",
    "gracePeriodToBlockAppsDuringOffClockHours":  null,
    "filterOpenInToOnlyManagedApps":  false,
    "managedBrowser":  "notConfigured",
    "appDataEncryptionType":  "whenDeviceLocked",
    "minimumWarningSdkVersion":  null,
    "screenCaptureConfigurationState":  "blocked",
    "minimumWipeOsVersion":  null,
    "faceIdBlocked":  false,
    "maximumAllowedDeviceThreatLevel":  "notConfigured",
    "appGroupType":  "allCoreMicrosoftApps",
    "maximumWipeOsVersion":  null,
    "allowedOutboundClipboardSharingLevel":  "managedAppsWithPasteIn",
    "minimumRequiredOsVersion":  null,
    "version":  "\"7001ea5f-0000-0300-0000-68bf44b60000\"",
    "messagingRedirectAppUrlScheme":  "",
    "organizationalCredentialsRequired":  false,
    "fingerprintBlocked":  false,
    "writingToolsConfigurationState":  "blocked",
    "allowedOutboundDataTransferDestinations":  "managedApps",
    "printBlocked":  false,
    "maximumRequiredOsVersion":  null,
    "minimumWarningOsVersion":  null,
    "thirdPartyKeyboardsBlocked":  false,
    "minimumWarningAppVersion":  null,
    "customDialerAppProtocol":  "",
    "targetedAppManagementLevels":  "unspecified",
    "pinRequiredInsteadOfBiometricTimeout":  null,
    "previousPinBlockCount":  0,
    "protectInboundDataFromUnknownSources":  false,
    "periodOfflineBeforeWipeIsEnforced":  "P30D",
    "saveAsBlocked":  true
}
